Section_4_Real_Workload_Validation/Experiment13/data/raw/case-A/sustained-ramp/trial_021/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 15.803ms, rate sampling interval: 39ms
  Thread calibration: mean lat.: 19.898ms, rate sampling interval: 52ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    20.19ms   11.10ms 198.78ms   92.30%
    Req/Sec   303.00    157.43     1.10k    61.20%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   17.23ms
 75.000%   21.04ms
 90.000%   29.10ms
 99.000%   67.26ms
 99.900%  141.18ms
 99.990%  184.06ms
 99.999%  194.82ms
100.000%  198.91ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.127     0.000000            1         1.00
      13.575     0.100000        10199         1.11
      14.607     0.200000        20446         1.25
      15.479     0.300000        30642         1.43
      16.335     0.400000        40842         1.67
      17.231     0.500000        51004         2.00
      17.727     0.550000        56127         2.22
      18.287     0.600000        61147         2.50
      18.991     0.650000        66295         2.86
      19.855     0.700000        71408         3.33
      21.039     0.750000        76443         4.00
      21.823     0.775000        78988         4.44
      22.751     0.800000        81562         5.00
      23.871     0.825000        84107         5.71
      25.247     0.850000        86643         6.67
      26.943     0.875000        89186         8.00
      27.903     0.887500        90445         8.89
      29.103     0.900000        91726        10.00
      30.191     0.912500        92999        11.43
      31.567     0.925000        94280        13.33
      33.343     0.937500        95540        16.00
      34.655     0.943750        96178        17.78
      36.223     0.950000        96814        20.00
      38.143     0.956250        97457        22.86
      40.159     0.962500        98088        26.67
      42.975     0.968750        98730        32.00
      44.895     0.971875        99047        35.56
      47.295     0.975000        99367        40.00
      49.695     0.978125        99680        45.71
      52.863     0.981250       100000        53.33
      56.735     0.984375       100317        64.00
      59.615     0.985938       100476        71.11
      62.431     0.987500       100637        80.00
      65.183     0.989062       100795        91.43
      68.607     0.990625       100955       106.67
      72.639     0.992188       101118       128.00
      74.687     0.992969       101193       142.22
      78.527     0.993750       101276       160.00
      81.727     0.994531       101355       182.86
      84.671     0.995313       101432       213.33
      90.495     0.996094       101512       256.00
      94.271     0.996484       101551       284.44
     100.671     0.996875       101592       320.00
     107.711     0.997266       101631       365.71
     115.263     0.997656       101672       426.67
     124.159     0.998047       101710       512.00
     126.143     0.998242       101731       568.89
     129.727     0.998437       101750       640.00
     135.167     0.998633       101770       731.43
     139.647     0.998828       101794       853.33
     141.823     0.999023       101810      1024.00
     146.687     0.999121       101822      1137.78
     147.583     0.999219       101831      1280.00
     149.119     0.999316       101841      1462.86
     163.327     0.999414       101850      1706.67
     171.263     0.999512       101861      2048.00
     174.207     0.999561       101865      2275.56
     176.127     0.999609       101870      2560.00
     179.199     0.999658       101875      2925.71
     181.503     0.999707       101880      3413.33
     182.655     0.999756       101886      4096.00
     182.783     0.999780       101889      4551.11
     182.911     0.999805       101890      5120.00
     183.551     0.999829       101893      5851.43
     183.679     0.999854       101895      6826.67
     183.807     0.999878       101897      8192.00
     183.935     0.999890       101898      9102.22
     184.063     0.999902       101900     10240.00
     184.447     0.999915       101901     11702.86
     184.575     0.999927       101902     13653.33
     184.831     0.999939       101904     16384.00
     184.831     0.999945       101904     18204.44
     185.983     0.999951       101905     20480.00
     185.983     0.999957       101905     23405.71
     190.591     0.999963       101906     27306.67
     190.591     0.999969       101906     32768.00
     194.047     0.999973       101907     36408.89
     194.047     0.999976       101907     40960.00
     194.047     0.999979       101907     46811.43
     194.815     0.999982       101908     54613.33
     194.815     0.999985       101908     65536.00
     194.815     0.999986       101908     72817.78
     194.815     0.999988       101908     81920.00
     194.815     0.999989       101908     93622.86
     198.911     0.999991       101909    109226.67
     198.911     1.000000       101909          inf
#[Mean    =       20.193, StdDeviation   =       11.100]
#[Max     =      198.784, Total count    =       101909]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  107690 requests in 3.00m, 87.60MB read
Requests/sec:    598.24
Transfer/sec:    498.33KB